# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/autoupdate'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fzf' # Fuzzy file/history search
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'jq' # Used for spatie/visit
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'starship'
brew 'stripe/stripe-cli/stripe'
brew 'svn' # Needed to install fonts
brew 'doctl'
brew 'wget'
brew 'terminal-notifier'
brew 'thefuck'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'asimov'
brew 'mysql-client'
brew 'n'
brew 'yarn'
brew 'go'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlvideo'

# Fonts
cask 'font-lato'
cask 'font-fira-code'
cask 'font-menlo-for-powerline'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ibm-plex-mono'
